[
  {
    "id": "1",
    "author": "Andy Hill",
    "date": "a month ago",
    "rating": 5,
    "text": "I love going to the dentist (yes, read that again) I absolutely love Cross Creeks! Everyone is always so friendly and they even know my name! As soon as I walk in, it's \"hi Andy, we got you checked in\". The hygienists are always great and, maybe more importantly, they always remember my new free toothbrush! I even get to pick the color! Dr. Melissa knows her stuff and her attention to detail is very much appreciated. And everyone is just great to talk to before, during and after my appointment. I've been going here for many years and I can truly say that Cross Creeks is the very best I've been too, and I'm 52 and I've seen more than a few!😁"
  },
  {
    "id": "2",
    "author": "Amanda Alderman",
    "date": "in the last week",
    "rating": 5,
    "text": "I took my girls and they both needed to have a tooth extracted. They were fantastic explaining every step to them and making sure they were comfortable. Personal calls from the doctor to make sure they were OK made both of them feel cared for. I would definitely recommend Cross Creeks to family and friends."
  },
  {
    "id": "3",
    "author": "jamison fraley",
    "date": "2 weeks ago",
    "rating": 5,
    "text": "My experience here is always great.  The Drs’ and staff are always amazing.  But much more important to me is the care they gave to my elderly mother when she couldn’t find a solution for her dental crisis.  They not only solved it for her, the made her very comfortable and happy with everything."
  },
  {
    "id": "4",
    "author": "Neener",
    "date": "2 weeks ago",
    "rating": 5,
    "text": "Great! Love them, super nice and patient with me and my angst. Everything was explained clearly to me. I am extremely happy with my visit. Had tooth extraction done, no pain\n😁..perfect."
  },
  {
    "id": "5",
    "author": "Don Corbett",
    "date": "3 weeks ago",
    "rating": 5,
    "text": "I had an excellent visit at Cross Creek Dental on Monday 10/27/2025 for a crown re-attachmenr and cleaning. I found all of the staff extremely professional and kind resulting in a pleasant experience. I plan on making Cross Creek Dental my care provider for all my dental care needs."
  }
]